# dotfiles — Homebrew Bundle (declarative packages)
# Location: pkg/brew/Brewfile  (outside config/ so it is never symlinked into ~/.config)
#
# Usage (from repo root or anywhere):
#   brew bundle --file pkg/brew/Brewfile --no-upgrade
#   brew bundle --file pkg/brew/Brewfile --upgrade   # for updates
#
# This file is the single source of truth for brew-managed packages.
# Run `./bootstrap update` (or `./bootstrap`) or `brew bundle` directly.
#
# macOS vs Linux conditionals use the Ruby DSL provided by `brew bundle`.
# On macOS, Emacs ships via the emacs-plus-app cask, which installs
# Emacs.app into /Applications directly — no post-install copy needed.

# --- Taps --------------------------------------------------------------------
# homebrew/core and homebrew/cask are fetched automatically via the JSON API;
# tapping them explicitly is no longer needed (and is rejected without --force).
#
# Note: brew bundle ignores `if: OS.mac?` keyword args silently — use Ruby's
# trailing `if` form (e.g. `brew "foo" if OS.mac?`) to actually gate entries.
tap "d12frosted/emacs-plus" if OS.mac?

# --- Core utilities ----------------------------------------------------------
brew "coreutils"
brew "diffutils"
brew "findutils"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "cmigemo"
brew "tmux"                     # terminal multiplexer (pre-warmed daemon in .zshrc)
brew "eza"
brew "bat"                      # cat replacement, also MANPAGER
brew "git-delta"                # git diff pager
brew "aspell"
brew "poppler"                  # pdf-tools for Emacs, rgpipe etc.
brew "automake"                 # pdf-tools for Emacs
brew "pandoc"
brew "weasyprint"               # for pandoc

# --- Shell ergonomics --------------------------------------------------------
brew "zoxide"                   # learning cd, exposed as `z`

# --- Dev tools ---------------------------------------------------------------
brew "git"
brew "gitleaks"

# --- TUI file manager --------------------------------------------------------
brew "yazi"
brew "ffmpeg"                   # yazi preview: video/audio
brew "sevenzip"                 # yazi preview: archives

# --- Languages & runtimes ----------------------------------------------------
brew "python"
brew "r"
brew "sbcl"
brew "node"

# --- Linux-only CLI ----------------------------------------------------------
# (none for now)

# --- Emacs -------------------------------------------------------------------
# macOS: prebuilt Emacs.app cask (auto-places into /Applications).
# Requires `brew trust d12frosted/emacs-plus` once to allow the 3rd-party tap.
cask "emacs-plus-app" if OS.mac?

# linux / others: standard Emacs from core
brew "emacs" if OS.linux?

# --- macOS GUI / Casks -------------------------------------------------------
cask "ghostty"            if OS.mac?
cask "karabiner-elements" if OS.mac?
cask "battery"            if OS.mac?

# --- Cleanup hint ------------------------------------------------------------
# After changes: brew bundle --file pkg/brew/Brewfile
# To dump current state for review: brew bundle dump --file pkg/brew/Brewfile --force
# (then edit to add comments/conditionals)

# vim: ft=ruby
