{
  "buckets": [
    {
      "Name": "main",
      "Source": "https://github.com/ScoopInstaller/Main"
    },
    {
      "Name": "extras",
      "Source": "https://github.com/ScoopInstaller/Extras"
    }
  ],
  "apps": [
    {
      "Name": "msys2",
      "Source": "extras"
    },
    {
      "Name": "ripgrep",
      "Source": "main"
    },
    {
      "Name": "fd",
      "Source": "main"
    },
    {
      "Name": "fzf",
      "Source": "main"
    },
    {
      "Name": "tree",
      "Source": "main"
    },
    {
      "Name": "eza",
      "Source": "main"
    },
    {
      "Name": "pandoc",
      "Source": "main"
    },
    {
      "Name": "weasyprint",
      "Source": "main"
    },
    {
      "Name": "poppler",
      "Source": "main"
    },
    {
      "Name": "git",
      "Source": "main"
    },
    {
      "Name": "gitleaks",
      "Source": "main"
    },
    {
      "Name": "tig",
      "Source": "extras"
    },
    {
      "Name": "python",
      "Source": "main"
    },
    {
      "Name": "nodejs",
      "Source": "main"
    },
    {
      "Name": "r",
      "Source": "main"
    },
    {
      "Name": "sbcl",
      "Source": "extras"
    },
    {
      "Name": "emacs",
      "Source": "extras"
    }
  ]
}
