{
  "buckets": [
    {
      "Name": "main",
      "Source": "https://github.com/ScoopInstaller/Main"
    },
    {
      "Name": "extras",
      "Source": "https://github.com/ScoopInstaller/Extras"
    }
  ],
  "apps": [
    {
      "Name": "msys2",
      "Source": "extras"
    },
    {
      "Name": "ripgrep",
      "Source": "main"
    },
    {
      "Name": "fd",
      "Source": "main"
    },
    {
      "Name": "fzf",
      "Source": "main"
    },
    {
      "Name": "eza",
      "Source": "main"
    },
    {
      "Name": "7zip",
      "Source": "main"
    },
    {
      "Name": "findutils",
      "Source": "main"
    },
    {
      "Name": "pandoc",
      "Source": "main"
    },
    {
      "Name": "weasyprint",
      "Source": "main"
    },
    {
      "Name": "poppler",
      "Source": "main"
    },
    {
      "Name": "git",
      "Source": "main"
    },
    {
      "Name": "gitleaks",
      "Source": "main"
    },
    {
      "Name": "python",
      "Source": "main"
    },
    {
      "Name": "nodejs",
      "Source": "main"
    },
    {
      "Name": "marp",
      "Source": "main"
    },
    {
      "Name": "r",
      "Source": "main"
    },
    {
      "Name": "sbcl",
      "Source": "extras"
    },
    {
      "Name": "emacs",
      "Source": "extras"
    },
    {
      "Name": "marktext",
      "Source": "extras"
    },
    {
      "Name": "win32yank",
      "Source": "main"
    },
    {
      "Name": "espanso",
      "Source": "main"
    },
    {
      "Name": "autohotkey",
      "Source": "extras"
    },
    {
      "Name": "everything",
      "Source": "extras"
    },
    {
      "Name": "flow-launcher",
      "Source": "extras"
    },
    {
      "Name": "quicklook",
      "Source": "extras"
    },
    {
      "Name": "winmerge",
      "Source": "extras"
    }
  ]
}
